БПКР/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставкиНДС</name>
    <type>
      <types>CatalogRef.КодыПоставокНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановленСрокОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДоговора</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентовПрисоединенныеФайлы</types>
    </type>
  </attributes>
</mdclass:Catalog>

БПКР/src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <type>
    <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    <types>CatalogRef.Номенклатура</types>
    <types>DocumentRef.ПоступлениеИзПереработки</types>
    <types>DocumentRef.КомплектацияНоменклатуры</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.Склады</types>
    <types>EnumRef.ВидыИзмененийВСобственномКапитале</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>DocumentRef.ОтчетОРозничныхПродажах</types>
    <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    <types>DocumentRef.ПеремещениеТоваров</types>
    <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>DocumentRef.АвансовыйОтчет</types>
    <types>CatalogRef.РасходыБудущихПериодов</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.ВидыОплатОрганизаций</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>DocumentRef.ДвижениеМБП</types>
    <types>CatalogRef.Субконто</types>
    <types>DocumentRef.ОприходованиеТоваров</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>DocumentRef.ВводНачальныхОстатков</types>
    <types>DocumentRef.ЗаказНаПроизводство</types>
  </type>
  <predefined>
    <items>
      <name>удалитьВидыИзмененийВСобственномКапитале</name>
      <description>Виды изменений в собственном капитале</description>
      <code>000032</code>
      <type>
        <types>EnumRef.ВидыИзмененийВСобственномКапитале</types>
      </type>
    </items>
    <items>
      <name>ВидыОплат</name>
      <description>Виды оплат</description>
      <code>000034</code>
      <type>
        <types>CatalogRef.ВидыОплатОрганизаций</types>
      </type>
    </items>
    <items>
      <name>ДенежныеСредства</name>
      <description>Денежные средства</description>
      <code>000003</code>
      <type>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000006</code>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Местонахождение</name>
      <description>Местонахождение</description>
      <code>000033</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Номенклатурные группы</description>
      <code>000015</code>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>000016</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>000025</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Партии</name>
      <description>Партии</description>
      <code>000023</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеИзПереработки</types>
        <types>DocumentRef.КомплектацияНоменклатуры</types>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ДвижениеМБП</types>
        <types>DocumentRef.ОприходованиеТоваров</types>
        <types>DocumentRef.ВводНачальныхОстатков</types>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>000013</code>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>000017</code>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000002</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СотрудникиОрганизаций</name>
      <description>Сотрудники организации</description>
      <code>000008</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
      <code>000004</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат и доходов</description>
      <code>000014</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

БПКР/src/CommonModules/СрокиОплатыДокументов/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает срок оплаты для документа, срок должен содержаться в регистре
//   Параметры:
//   Организация - СправочникСсылка.Организации - Организация по которой нужны данные
//   Ссылка      - ДокументСсылка.* - документ, для которого нужно получить срок оплаты
//
// Возвращаемое значение:
//   СрокОплаты - Дата - если срока нет в регистре, то возвращается Неопределено
//
Функция УстановленныйСрокОплаты(Ссылка, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Документ",    Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СрокиОплатыДокументов.СрокОплаты
	|ИЗ
	|	РегистрСведений.СрокиОплатыДокументов КАК СрокиОплатыДокументов
	|ГДЕ
	|	СрокиОплатыДокументов.Организация = &Организация
	|	И СрокиОплатыДокументов.Документ = &Документ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.СрокОплаты;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Возвращает таблицу с просроченной задолженностью поставщикам
// Параметры:
//   Организация - СправочникСсылка.Организации - отбор по организации (может быть пустой).
//   ДатаЗадолженности - Дата - на какую дату будет получена задолженность.
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. ПросроченнаяЗадолженность().
//
Функция ПросроченнаяЗадолженностьПоставщикам(Организация, ДатаЗадолженности, РазрешеноИспользоватьТекущиеИтоги = Ложь) Экспорт
	
	Возврат ПросроченнаяЗадолженность(
				2,
				Организация,
				ДатаЗадолженности,
				РазрешеноИспользоватьТекущиеИтоги);

КонецФункции

// Возвращает таблицу с просроченной задолженностью покупателей
// Параметры:
//   Организация - СправочникСсылка.Организации - отбор по организации (может быть пустой).
//   ДатаЗадолженности - Дата - на какую дату будет получена задолженность.
//   РазрешеноИспользоватьТекущиеИтоги - Булево - Если Истина, то при совпадении даты задолженности с текущим днем, 
//				будут использованы текущие итоги регистра бухгалтерии.
//   РазрешеноИспользоватьТекущиеИтоги - Булево - Если Истина, то при совпадении даты задолженности с текущим днем, 
//				будут использованы текущие итоги регистра бухгалтерии.
//
// Возвращаемое значение:
//   ТаблицаЗначений - см. ПросроченнаяЗадолженность().
//
Функция ПросроченнаяЗадолженностьПокупателей(Организация, ДатаЗадолженности, РазрешеноИспользоватьТекущиеИтоги = Ложь) Экспорт
	
	Возврат ПросроченнаяЗадолженность(
				1,
				Организация,
				ДатаЗадолженности,
				РазрешеноИспользоватьТекущиеИтоги);
	
КонецФункции

// Возвращает таблицу с просроченной задолженностью поставщикам
// Параметры:
//   Тип         - Число - определяет для кого надо получить данные: 1 - покупатель, 2 - поставщик
//   Организация - СправочникСсылка.Организации - отбор по организации (может быть пустой).
//   ДатаЗадолженности - Дата - на какую дату будет получена задолженность
//   РазрешеноИспользоватьТекущиеИтоги - Булево - Если Истина, то при совпадении даты задолженности с текущим днем, 
//				будут использованы текущие итоги регистра бухгалтерии.
//
// Возвращаемое значение:
//   ТаблицаЗначений
//     *Организация                    - СправочникСсылка.Организации
//     *Контрагент                     - СправочникСсылка.Контрагенты
//     *Договор                        - СправочникСсылка.ДоговорыКонтрагентов
//     *Документ                       - Документ расчетов с контрагентом
//     *ПросроченнаяЗадолженность      - Число
//
Функция ПросроченнаяЗадолженность(Тип, Организация, ДатаЗадолженности, РазрешеноИспользоватьТекущиеИтоги)
	
	СписокОрганизаций = БухгалтерскиеОтчеты.СписокДоступныхОрганизаций(Организация);
	
	Запрос = НовыйЗапросПросроченнаяЗадолженность(Тип, СписокОрганизаций, ДатаЗадолженности, РазрешеноИспользоватьТекущиеИтоги);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//ПросроченнаяЗадолженность = РезультатЗапроса[3].Выгрузить(); // учтены сроки оплаты документов
	
	СрокиОплаты = РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("СрокОплаты"); // сроки оплаты долгов без документов
	
	// Не для всех задолженностей можно определить документ расчетов, и, как следствие - дату возникновения долга.
	// Поэтому для долгов без документов используется следующая методика:
	// Получаем сумму долга на дату задолженности, из этой суммы вычитаем сумму увеличения долга за период отсрочки.
	// Например, долг, который был вчера, это долг, который есть сегодня, минус увеличение долга за этот один день.
	// Таким образом, получаем сумму просроченной задолженностью.
	Если СрокиОплаты.Количество() > 0 Тогда
		
		ДлинаСуток = 86400;
		ТекстЗапросаУвеличениеДолга = "";
		
		Для Индекс = 0 По СрокиОплаты.ВГраница() Цикл
			
			СрокОплаты             = СрокиОплаты[Индекс];
			ДатаНачалаИнтервала    = НачалоДня(ДатаЗадолженности - ДлинаСуток * СрокОплаты);
			ГраницаНачалаИнтервала = Новый Граница(ДатаНачалаИнтервала, ВидГраницы.Включая);
			
			Запрос.УстановитьПараметр("НачалоИнтервала" + (Индекс+1), ГраницаНачалаИнтервала);
			Запрос.УстановитьПараметр("СрокОплаты"      + (Индекс+1), СрокОплаты);
			
			Если НЕ ПустаяСтрока(ТекстЗапросаУвеличениеДолга) Тогда
				ТекстЗапросаУвеличениеДолга = ТекстЗапросаУвеличениеДолга + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
			КонецЕсли;
			
			ТекстЗапросаУвеличениеДолга = ТекстЗапросаУвеличениеДолга + ТекстЗапросаУвеличениеДолгаЗаПериодСрока(Тип, Индекс+1);
			
		КонецЦикла;
		
		Запрос.Текст = ТекстЗапросаУвеличениеДолга + ОбщегоНазначения.РазделительПакетаЗапросов()
					 + ТекстЗапросаПодсчетПросроченногоДолгаБезДокументов();
		
		ПросроченнаяЗадолженность = Запрос.Выполнить().Выгрузить();
		//ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОстальнаяПросроченнаяЗадолженность, ПросроченнаяЗадолженность);
		
	КонецЕсли;
	
	Возврат ПросроченнаяЗадолженность;
	
КонецФункции

Функция ПредставлениеСрокаОплаты(СрокОплаты) Экспорт
	
	ТекстСрокОплаты = НСтр("ru = 'Срок %1'");
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСрокОплаты, Формат(СрокОплаты, "ДФ=dd.MM.yyyy"));
	
КонецФункции

// Возвращает срок оплаты выставленного счета по умолчанию
// Возвращаемое значение:
//   СрокОплаты - Число
//
Функция СрокОплатыСчетаПокупателюПоУмолчанию() Экспорт
	
	Возврат 3;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйЗапросПросроченнаяЗадолженность(Тип, СписокОрганизаций, ДатаЗадолженности, РазрешеноИспользоватьТекущиеИтоги)
	
	Если Тип = 1 Тогда
		
		ВидыДоговоров            = БухгалтерскиеОтчеты.ВидыДоговоровПокупателей();
		СчетаУчетаРасчетов       = МониторРуководителя.СчетаРасчетовСКонтрагентами(1);
		СрокОплатыПараметрыУчета = Константы.СрокОплатыПокупателей.Получить();
		ИспользуютсяСрокиОплаты  = СрокОплатыПараметрыУчета > 0;
		
	ИначеЕсли Тип = 2 Тогда
		
		ВидыДоговоров            = БухгалтерскиеОтчеты.ВидыДоговоровПоставщиков();
		СчетаУчетаРасчетов       = МониторРуководителя.СчетаРасчетовСКонтрагентами(2);
		СрокОплатыПараметрыУчета = Константы.СрокОплатыПоставщикам.Получить();
		ИспользуютсяСрокиОплаты  = СрокОплатыПараметрыУчета > 0;
		
	КонецЕсли;
	
	ВидСубконтоКонтрагенты = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты;
	ВидСубконтоДоговоры    = ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры;
	
	ВидыСубконтоКД = Новый СписокЗначений;
	ВидыСубконтоКД.Добавить(ВидСубконтоКонтрагенты);
	ВидыСубконтоКД.Добавить(ВидСубконтоДоговоры);
	
	//ВидыСубконтоКДД = Новый СписокЗначений;
	//ВидыСубконтоКДД.Добавить(ВидСубконтоКонтрагенты);
	//ВидыСубконтоКДД.Добавить(ВидСубконтоДоговоры);
	//ВидыСубконтоКДД.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокОрганизаций",         СписокОрганизаций);
	Запрос.УстановитьПараметр("ВидыДоговоров",             ВидыДоговоров);
	Запрос.УстановитьПараметр("КонецИнтервала",            КонецДня(ДатаЗадолженности));
	Запрос.УстановитьПараметр("ВидыСубконтоКД",            ВидыСубконтоКД);
	//Запрос.УстановитьПараметр("ВидыСубконтоКДД",           ВидыСубконтоКДД);
	Если РазрешеноИспользоватьТекущиеИтоги И КонецДня(ДатаЗадолженности) = КонецДня(ТекущаяДатаСеанса()) Тогда
		// Если остатки получаются "на сегодня", то обращаемся к текущим итогам регистра.
		Запрос.УстановитьПараметр("ГраницаОстатков",       Неопределено);
	Иначе
		Запрос.УстановитьПараметр("ГраницаОстатков",       Новый Граница(КонецДня(ДатаЗадолженности), ВидГраницы.Включая));
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаЗадолженности",         НачалоДня(ДатаЗадолженности));
	Запрос.УстановитьПараметр("СтандартныйСрокОплаты",     СрокОплатыПараметрыУчета);
	//Запрос.УстановитьПараметр("СчетаСДокументомРасчетов",  СчетаУчетаРасчетов.СчетаСДокументомРасчетов);
	Запрос.УстановитьПараметр("СчетаБезДокументаРасчетов", СчетаУчетаРасчетов);
	//Запрос.УстановитьПараметр("ИспользуютсяСрокиОплаты",   ИспользуютсяСрокиОплаты);
	
	Запрос.Текст = ТекстЗапросСрокиДолговБезДокументов(Тип);
	
	Возврат Запрос;
	
КонецФункции

Функция ТекстЗапросСрокиДолговБезДокументов(Тип)
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыОстатки.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ВзаиморасчетыОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ВзаиморасчетыОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ВзаиморасчетыОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).УстановленСрокОплаты
	|			ТОГДА ВЫРАЗИТЬ(ВзаиморасчетыОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов).СрокОплаты
	|		ИНАЧЕ &СтандартныйСрокОплаты
	|	КОНЕЦ КАК СрокОплаты,
	|	ВзаиморасчетыОстатки.СуммаРазвернутыйОстатокДт КАК ОстатокДолга
	|ПОМЕСТИТЬ ОстаткиДолгаБезДокументовБезГруппировки
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ГраницаОстатков,
	|			Счет В (&СчетаБезДокументаРасчетов),
	|			&ВидыСубконтоКД,
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).ВидДоговора В (&ВидыДоговоров)
	|				И Организация В (&СписокОрганизаций)) КАК ВзаиморасчетыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДолгаБезДокументовБезГруппировки.Организация КАК Организация,
	|	ОстаткиДолгаБезДокументовБезГруппировки.Контрагент КАК Контрагент,
	|	ОстаткиДолгаБезДокументовБезГруппировки.Договор КАК Договор,
	|	ОстаткиДолгаБезДокументовБезГруппировки.СрокОплаты КАК СрокОплаты,
	|	СУММА(ОстаткиДолгаБезДокументовБезГруппировки.ОстатокДолга) КАК ОстатокДолга
	|ПОМЕСТИТЬ ОстаткиДолгаБезДокументов
	|ИЗ
	|	ОстаткиДолгаБезДокументовБезГруппировки КАК ОстаткиДолгаБезДокументовБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиДолгаБезДокументовБезГруппировки.Договор,
	|	ОстаткиДолгаБезДокументовБезГруппировки.Организация,
	|	ОстаткиДолгаБезДокументовБезГруппировки.Контрагент,
	|	ОстаткиДолгаБезДокументовБезГруппировки.СрокОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиДолгаБезДокументов.СрокОплаты КАК СрокОплаты
	|ИЗ
	|	ОстаткиДолгаБезДокументов КАК ОстаткиДолгаБезДокументов";
	
	Если Тип = 2 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СуммаРазвернутыйОстатокДт", "СуммаРазвернутыйОстатокКт");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаУвеличениеДолгаЗаПериодСрока(Тип, Индекс)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВзаиморасчетыОбороты.Организация КАК Организация,
	|	ВзаиморасчетыОбороты.Субконто1 КАК Контрагент,
	|	ВзаиморасчетыОбороты.Субконто2 КАК Договор,
	|	&ПолеУвеличениеДолга КАК УвеличениеДолга"
	+
	?(Индекс = 1, Символы.ПС + "ПОМЕСТИТЬ УвеличениеДолгаБезГруппировки" + Символы.ПС, Символы.ПС)
	+
	"ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоИнтервала0,
	|			&ГраницаОстатков,
	|			,
	|			Счет В (&СчетаБезДокументаРасчетов),
	|			&ВидыСубконтоКД,
	|			ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).УстановленСрокОплаты
	|						ТОГДА ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов).СрокОплаты
	|					ИНАЧЕ &СтандартныйСрокОплаты
	|				КОНЕЦ = &СрокОплаты0
	|				И Организация В(&СписокОрганизаций),
	|			,
	|			) КАК ВзаиморасчетыОбороты";
	
	Если Тип = 1 Тогда
		ТекстПоляУвеличениеДолга = 
		"ВЫБОР
		|	КОГДА ВзаиморасчетыОбороты.СуммаОборотДт > 0
		|		ТОГДА ВзаиморасчетыОбороты.СуммаОборотДт
		|	ИНАЧЕ 0
		|КОНЕЦ - ВЫБОР
		|	КОГДА ВзаиморасчетыОбороты.СуммаОборотДт < 0
		|		ТОГДА ВзаиморасчетыОбороты.СуммаОборотДт
		|	ИНАЧЕ 0
		|КОНЕЦ";
	ИначеЕсли Тип = 2 Тогда
		ТекстПоляУвеличениеДолга = 
		"ВЫБОР
		|	КОГДА ВзаиморасчетыОбороты.СуммаОборотКт > 0
		|		ТОГДА ВзаиморасчетыОбороты.СуммаОборотКт
		|	ИНАЧЕ 0
		|КОНЕЦ - ВЫБОР
		|	КОГДА ВзаиморасчетыОбороты.СуммаОборотДт < 0
		|		ТОГДА ВзаиморасчетыОбороты.СуммаОборотДт
		|	ИНАЧЕ 0
		|КОНЕЦ";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолеУвеличениеДолга", ТекстПоляУвеличениеДолга);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НачалоИнтервала0"    , "НачалоИнтервала" + Индекс);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СрокОплаты0"         , "СрокОплаты"      + Индекс);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПодсчетПросроченногоДолгаБезДокументов()
	
	Возврат
	"ВЫБРАТЬ
	|	УвеличениеДолгаБезГруппировки.Организация КАК Организация,
	|	УвеличениеДолгаБезГруппировки.Контрагент КАК Контрагент,
	|	УвеличениеДолгаБезГруппировки.Договор КАК Договор,
	|	СУММА(УвеличениеДолгаБезГруппировки.УвеличениеДолга) КАК УвеличениеДолга
	|ПОМЕСТИТЬ УвеличениеДолгаДляВсехСроков
	|ИЗ
	|	УвеличениеДолгаБезГруппировки КАК УвеличениеДолгаБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	УвеличениеДолгаБезГруппировки.Договор,
	|	УвеличениеДолгаБезГруппировки.Организация,
	|	УвеличениеДолгаБезГруппировки.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиДолгаБезДокументов.Организация,
	|	ОстаткиДолгаБезДокументов.Контрагент,
	|	ОстаткиДолгаБезДокументов.Договор,
	|	ВЫБОР
	|		КОГДА ОстаткиДолгаБезДокументов.ОстатокДолга > ЕСТЬNULL(УвеличениеДолгаДляВсехСроков.УвеличениеДолга, 0)
	|			ТОГДА ОстаткиДолгаБезДокументов.ОстатокДолга - ЕСТЬNULL(УвеличениеДолгаДляВсехСроков.УвеличениеДолга, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПросроченнаяЗадолженность
	|ИЗ
	|	ОстаткиДолгаБезДокументов КАК ОстаткиДолгаБезДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ УвеличениеДолгаДляВсехСроков КАК УвеличениеДолгаДляВсехСроков
	|		ПО ОстаткиДолгаБезДокументов.Организация = УвеличениеДолгаДляВсехСроков.Организация
	|			И ОстаткиДолгаБезДокументов.Контрагент = УвеличениеДолгаДляВсехСроков.Контрагент
	|			И ОстаткиДолгаБезДокументов.Договор = УвеличениеДолгаДляВсехСроков.Договор";
	
КонецФункции

#Область ПроцедурыОбновленияИБ

//// Заполняет начальные наcтройки ИБ
////
//Процедура УстановитьСрокиОплатыСчетов() Экспорт 
//	
//	Константы.СрокОплатыСчетовПокупателю.Установить(СрокОплатыСчетаПокупателюПоУмолчанию());
//	
//КонецПроцедуры

#КонецОбласти

#КонецОбласти
